<script setup lang="ts">
import { TextVue } from "../components/shared";
</script>

<template>
  <div class="mx-auto max-w-7xl w-full flex flex-col py-12 px-3 xl:py-28 xl:px-36">
    <div class="grid grid-cols-1 justify-items-center xl:grid-cols-[1fr_320px] xl:gap-4 xl:justify-items-stretch">
      <TextVue :main="true">
        Привет! Меня зовут Артур, здесь я хочу рассказать историю о том, почему программирование стало для меня любимым
        занятием.
      </TextVue>
      <img src="../assets/photo_1.png" alt="фото меня, вкусно поевшего" class="self-center xl:row-span-2 xl:max-w-xs" />
      <div class="flex flex-col gap-3">
        <TextVue>
          Когда я впервые начал работать в нефтяной отрасли, я думал, что это будет полноценная и захватывающая карьера.
          Но через несколько лет я понял, что не доволен своей работой. Работа была однообразной, и я не мог использовать
          свои творческие способности или навыки решения проблем. Я знал, что мне нужны перемены.
        </TextVue>
        <TextVue>
          Именно тогда я начал изучать другие варианты и, в конце концов, наткнулся на программирование. Сначала меня
          пугала идея изучения нового навыка, но также меня заинтриговала идея создать что-то с нуля. Итак, я решил
          рискнуть и начать учиться.
        </TextVue>
      </div>
    </div>

    <div class="grid grid-cols-1 justify-items-center xl:grid-cols-[512px_1fr] xl:gap-4 xl:justify-items-stretch">
      <img src="../assets/photo_2.png" alt="фото меня, вкусно поевшего" class="self-center max-w-lg" />
      <div class="flex flex-col gap-3 items-center">
        <TextVue>
          Сначала было нелегко. Мне пришлось выучить совершенно новый язык и способ мышления. Но когда я начал понимать
          основы, я понял, что программирование стало для меня вызовом, которого никогда не было на моей предыдущей
          работе. Каждый день приходилось решать новую проблему, преодолевать новые трудности. И по мере того, как я
          становился лучше, задачи только усложнялись.
        </TextVue>
        <TextVue>
          Но это то, что я люблю в программировании. Всегда есть что-то новое, что можно узнать, всегда есть новая
          проблема, которую нужно решить. И даже когда возникают проблемы, я знаю, что есть сообщество разработчиков,
          которые готовы помочь. Сообщество веб-разработчиков, в частности, невероятно энергично и поддерживает. Будь то
          онлайн-форумы или встречи, я обнаружил, что всегда есть люди, которые готовы протянуть руку помощи или
          сотрудничать в проекте.
        </TextVue>
        <TextVue>
          Прошло уже несколько лет с тех пор, как я переключился на программирование, и я могу честно сказать, что никогда
          не был так счастлив в своей карьере. Мне нравится чувство создания чего-то из ничего, и мне нравится чувство
          выполненного долга, которое приходит с решением сложной проблемы. И хотя я знаю, что впереди всегда будут новые
          вызовы, я рад тому, куда ведет меня эта карьера.
        </TextVue>
      </div>
    </div>
  </div>
</template>
